In [1]:
import numpy as np
import pandas as pd

#### Loading zoo.csv dataset

In [2]:
zoo = pd.read_csv('zoo.csv', delimiter = ',')
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [3]:
zoo.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

In [4]:
zoo[['animal']].count()

animal    22
dtype: int64

In [5]:
zoo.animal.count()

22

In [6]:
zoo.water_need.sum()

7650

In [7]:
zoo.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

In [8]:
zoo.water_need.min()

80

In [9]:
zoo.water_need.max()

600

In [10]:
zoo.water_need.mean()

347.72727272727275

In [11]:
zoo.water_need.median()

325.0

### Grouping in pandas

In [12]:
zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [13]:
zoo.groupby('animal').mean()[['water_need']]

          water_need
animal
elephant  550.000000
kangaroo  416.666667
lion      477.500000
tiger     310.000000
zebra     184.285714

In [14]:
zoo.groupby('animal').mean().water_need

animal
elephant    550.000000
kangaroo    416.666667
lion        477.500000
tiger       310.000000
zebra       184.285714
Name: water_need, dtype: float64

### Reading travel blog dataset

In [16]:
article_read = pd.read_csv('pandas_tutorial_read.csv', delimiter=';', names =
                          ['my_datatime', 'event', 'country', 'user_id', 'source', 'topic'])

In [17]:
article_read.head()

           my_datatime event    country     user_id   source          topic
0  2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1  2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2  2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3  2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4  2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America

In [18]:
article_read.groupby('source').count()

         my_datatime  event  country  user_id  topic
source
AdWords          500    500      500      500    500
Reddit           949    949      949      949    949
SEO              346    346      346      346    346

In [ ]:
article_read[article]